In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('csv_exam.csv', encoding = 'utf-8')

In [5]:
df

    id  class  math  english  science
0    1      1    50       98       50
1    2      1    60       97       60
2    3      1    45       86       78
3    4      1    30       98       58
4    5      2    25       80       65
5    6      2    50       89       98
6    7      2    80       90       45
7    8      2    90       78       25
8    9      3    20       98       15
9   10      3    50       98       45
10  11      3    65       65       65
11  12      3    45       85       32
12  13      4    46       98       65
13  14      4    48       87       12
14  15      4    75       56       78
15  16      4    58       98       65
16  17      5    65       68       98
17  18      5    80       78       90
18  19      5    89       68       87
19  20      5    78       83       58

In [7]:
print(pd.__version__)

1.1.3

- Series

In [8]:
sr_data = pd.Series({"a":1, "b":2, "c":3})
sr_data

a    1
b    2
c    3
dtype: int64

In [19]:
list_data = ['2020-01-01', 3.14, 'ABC', 100, True]
sr_data = pd.Series(list_data)
sr_data

0    2020-01-01
1          3.14
2           ABC
3           100
4          True
dtype: object

In [20]:
sr_data.index

RangeIndex(start=0, stop=5, step=1)

In [21]:
sr_data.values

array(['2020-01-01', 3.14, 'ABC', 100, True], dtype=object)

In [36]:
tup_data = ('BH', '1991-11-29', 'M', True)
sr_data = pd.Series(tup_data, index = ['name', 'birth', 'gender', 'student'])
sr_data

name               BH
birth      1991-11-29
gender              M
student          True
dtype: object

In [37]:
sr_data[0]

'BH'

In [38]:
sr_data['name']

'BH'

In [39]:
sr_data[[1, 2]]

birth     1991-11-29
gender             M
dtype: object

In [40]:
sr_data[['birth', 'gender']]

birth     1991-11-29
gender             M
dtype: object

In [41]:
sr_data[1:3]

birth     1991-11-29
gender             M
dtype: object

In [42]:
sr_data['birth' : 'gender']

birth     1991-11-29
gender             M
dtype: object

- DataFrame

In [46]:
df.count()

id         20
class      20
math       20
english    20
science    20
dtype: int64

In [50]:
df['class'].value_counts()

5    4
4    4
3    4
2    4
1    4
Name: class, dtype: int64

In [49]:
df.rename(columns = {'math' : 'Math'}).head()

   id  class  Math  english  science
0   1      1    50       98       50
1   2      1    60       97       60
2   3      1    45       86       78
3   4      1    30       98       58
4   5      2    25       80       65

In [ ]:
df.dorp(1).head(3) # axis = 1 == drop columns defualt : 0

In [ ]:
df.drop(['class'], axis = 1).head(3)

In [52]:
df.loc[5]

id          6
class       2
math       50
english    89
science    98
Name: 5, dtype: int64

In [54]:
df.iloc[5]

id          6
class       2
math       50
english    89
science    98
Name: 5, dtype: int64

In [56]:
df.loc[[1, 4, 5], :]

   id  class  math  english  science
1   2      1    60       97       60
4   5      2    25       80       65
5   6      2    50       89       98

In [58]:
df.iloc[[1, 4, 5], :]

   id  class  math  english  science
1   2      1    60       97       60
4   5      2    25       80       65
5   6      2    50       89       98

In [59]:
df[df['class'] == 1]

   id  class  math  english  science
0   1      1    50       98       50
1   2      1    60       97       60
2   3      1    45       86       78
3   4      1    30       98       58

In [61]:
df[(df['class'] == 1) & (df['math'] >= 50 )]

   id  class  math  english  science
0   1      1    50       98       50
1   2      1    60       97       60

In [67]:
# notin or isin : filtering function !!!!
df[df['math'].isin([80,90])]

    id  class  math  english  science
6    7      2    80       90       45
7    8      2    90       78       25
17  18      5    80       78       90